<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Authentication Defaults
    |--------------------------------------------------------------------------
    |
    | デフォルトでは「一般ユーザー(web)」のガードを使うよう設定。
    | 管理者ログインでは別ガード(admin)を使う。
    |
    */

    'defaults' => [
        'guard' => 'web',
        'passwords' => 'users',
    ],

    /*
    |--------------------------------------------------------------------------
    | Authentication Guards
    |--------------------------------------------------------------------------
    |
    | 「guard（ガード）」はログインの仕組み単位。
    | web … 一般ユーザー用
    | admin … 管理者用
    |
    */

    'guards' => [
        'web' => [
            'driver' => 'session',
            'provider' => 'users',
        ],

        // 管理者ログイン専用ガード
        'admin' => [
            'driver' => 'session',
            'provider' => 'admins',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | User Providers
    |--------------------------------------------------------------------------
    |
    | 「provider（プロバイダ）」は、ユーザー情報をどのモデルから
    | 取得するかを決める設定。
    | users … 一般ユーザー用
    | admins … 管理者用
    |
    */

    'providers' => [
        // 一般ユーザー
        'users' => [
            'driver' => 'eloquent',
            'model' => App\Models\User::class,
        ],

        // 管理者モデル
        'admins' => [
            'driver' => 'eloquent',
            'model' => App\Models\Administrator::class,
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Resetting Passwords
    |--------------------------------------------------------------------------
    |
    | パスワードリセット設定。ユーザーと管理者を分ける場合は
    | ここにも別設定を追加するが、今回はユーザーのみでOK。
    |
    */

    'passwords' => [
        'users' => [
            'provider' => 'users',
            'table' => 'password_resets',
            'expire' => 60,
            'throttle' => 60,
        ],

        //  管理者パスワードリセット
        // 'admins' => [
        //     'provider' => 'admins',
        //     'table' => 'admin_password_resets',
        //     'expire' => 60,
        //     'throttle' => 60,
        // ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Password Confirmation Timeout
    |--------------------------------------------------------------------------
    */

    'password_timeout' => 10800,

];
